divekarshubham/amazon-freertos/vendors/cypress/MTB/ota/ports/CY8CKIT_064S0S2_4343W/ota_pal_for_aws/ota_pal.c
/*
 * Amazon FreeRTOS OTA PAL V1.0.0
 * Copyright (C) 2018 Amazon.com, Inc. or its affiliates.  All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 * http://aws.amazon.com/freertos
 * http://www.FreeRTOS.org
 */

/**
 * @file aws_ota_pal.c
 * @brief Platform Abstraction layer for AWS OTA
 *
 * NOTE: This implementation will handle a single NSPE binary file (normal application) or
 *       a tarball which has a "components.json" describing the files contained therein
 *       "components.json" is generated during the build process and added to the tarball.
 *
 * NOTE: When using the tarball OTA file, you must use HTTP transport (not MQTT)
 *       When using HTTP transport, the AFRTOS system heap must be increased (300k seems to work well)
 *       see projects/cypress/<board>/mtb/<appname>/config_files/FreeRTOSConfig.h
 *       #define configTOTAL_HEAP_SIZE                      ( ( size_t ) ( 300 * 1024 ) )
 */

/* C Runtime includes. */
#include <stdlib.h>
#include <string.h>

/* Amazon FreeRTOS include. */
#include "FreeRTOS.h"
#include "FreeRTOSConfig.h"
#include "ota_pal.h"
#include "bootutil/bootutil.h"
#include "sysflash/sysflash.h"
#include "flash_map_backend/flash_map_backend.h"
#include "cy_pdl.h"
#include "mbedtls/base64.h"
#include "mbedtls/sha256.h"
#include "iot_crypto.h"

/* OTA_DO_NOT_USE_CUSTOM_CONFIG allows building the OTA library
 * without a custom config. If a custom config is provided, the
 * OTA_DO_NOT_USE_CUSTOM_CONFIG macro should not be defined. */
#ifndef OTA_DO_NOT_USE_CUSTOM_CONFIG
    #include "ota_config.h"
#endif

/* Include config defaults header to get default values of configs not defined
 * in ota_config.h file. */
#include "ota_config_defaults.h"

/* Added for Flash Read */
#include "flash_map_backend/flash_map_backend.h"
#include "flash_qspi/flash_qspi.h"
#include "cy_smif_psoc6.h"

#include "untar.h"

/* define CY_TEST_APP_VERSION_IN_TAR to test application version in TAR archive at start of OTA image download
 * NOTE: This requires that the user set the version numbers in the header file and
 *          in the Makefile and that they match.
 *          APP_VERSION_MAJOR
 *          APP_VERSION_MINOR
 *          APP_VERSION_BUILD
 */
#ifdef CY_TEST_APP_VERSION_IN_TAR
    #include "aws_application_version.h"
#endif

/* For tarball support */

/**
 * @brief Tarball support file types recognized in components.json file
 *
 * The file type in the tarball
 */
#define CY_FILE_TYPE_SPE     "SPE"          /**< Secure Programming Environment (TFM) code type               */
#define CY_FILE_TYPE_NSPE    "NSPE"         /**< Non-Secure Programming Environment (application) code type   */

/**
 * @brief File Signature Key
 *
 * The OTA signature algorithm we support on this platform.
 */
const char OTA_JsonFileSignatureKey[ OTA_FILE_SIG_KEY_STR_MAX_LENGTH ] = "sig-sha256-ecdsa";

/***********************************************************************
 *
 * defines
 *
 **********************************************************************/
static const char pcOTA_PAL_CERT_BEGIN[] = "-----BEGIN CERTIFICATE-----";
static const char pcOTA_PAL_CERT_END[] = "-----END CERTIFICATE-----";

/***********************************************************************
 *
 * Macros
 *
 **********************************************************************/

#if 1 /* Debugging macros */

/**
 * @brief Macro to print system context information
 */
    #define PRINT_SYSTEM_CONTEXT_PTR()

/**
 * @brief Macro to print Boot swap type
 */
    #define PRINT_BOOT_SWAP_TYPE( title, boot_type )

/**
 * @brief Macro to print eState value
 */
    #define PRINT_eSTATE( title, eSTATE )

/**
 * @brief Macro to print PAL state
 */
    #define PRINT_PAL_STATE( title, palState )
#else /* if 1 */
    #define PRINT_SYSTEM_CONTEXT_PTR()    LogDebug( ( "   sys_ctx: %p\n", sys_ctx ) );

    #define PRINT_BOOT_SWAP_TYPE( title, boot_type )                                 \
    LogDebug( ( "%s:: boot_swap_type:%d (%s)\n", ( ( title == NULL ) ? "" : title ), \
                boot_type, ( ( boot_type == 0 ) ? "Unknown" :                        \
                             ( boot_type == BOOT_SWAP_TYPE_NONE ) ? "None" :         \
                             ( boot_type == BOOT_SWAP_TYPE_TEST ) ? "Test" :         \
                             ( boot_type == BOOT_SWAP_TYPE_PERM ) ? "Permanent" :    \
                             ( boot_type == BOOT_SWAP_TYPE_REVERT ) ? "Revert" :     \
                             ( boot_type == BOOT_SWAP_TYPE_FAIL ) ? "FAIL" :         \
                             ( boot_type == BOOT_SWAP_TYPE_PANIC ) ? "PANIC !!" : "Bad State" ) ) );

    #define PRINT_eSTATE( title, state )                                                     \
    LogDebug( ( "%s::   Sys Image State: 0x%lx (%s) \n", ( ( title == NULL ) ? "" : title ), \
                state, ( ( state == OtaImageStateUnknown ) ? "Unknown" :                     \
                         ( state == OtaImageStateTesting ) ? "Testing" :                     \
                         ( state == OtaImageStateAccepted ) ? "Accepted" :                   \
                         ( state == OtaImageStateRejected ) ? "Rejected" :                   \
                         ( state == OtaImageStateAborted ) ? "Aborted" : "ERROR" ) ) );

