divekarshubham/amazon-freertos/vendors/cypress/MTB/ota/ports/CY8CKIT_064S0S2_4343W/ota_pal_for_aws/ota_pal.c
    #define PRINT_PAL_STATE( title, palState )                                               \
    LogDebug( ( "%s::   PAL Image State: 0x%lx (%s) \n", ( ( title == NULL ) ? "" : title ), \
                palState, ( ( palState == OtaPalImageStateUnknown ) ? "Unknown" :            \
                            ( palState == OtaPalImageStatePendingCommit ) ? "Pending" :      \
                            ( palState == OtaPalImageStateValid ) ? "Valid" :                \
                            ( palState == OtaPalImageStateInvalid ) ? "Invalid" : "ERROR" ) ) );

#endif /* Debugging Macros */

/***********************************************************************
 *
 * Structures
 *
 **********************************************************************/

/***********************************************************************
 *
 * Variables
 *
 **********************************************************************/

/**
 * @brief Ptr to system context
 *
 * Keep track of system context between calls from the OTA Agent
 *
 */
const OtaFileContext_t * sys_ctx;

/**
 * @brief Current OTA Image State
 *
 * Keep track of the state OTA Agent wants us to be in.
 */
static OTA_ImageState_t current_OTA_ImageState = OtaImageStateUnknown;

/**
 * @brief Last time we ran a signature check
 *
 * Keep track of the last signature check value for otaPal_SetPlatformImageState
 */
static OtaErr_t last_signature_check;

/***********************************************************************
 *
 * UNTAR variables
 *
 **********************************************************************/

/**
 * @brief Context structure for parsing the tar file
 */
cy_untar_context_t ota_untar_context;

/**
 * @brief Flag to denote this is a tar file
 *
 * We use this flag on subsequent chunks of file to know how to handle the data
 */
int ota_is_tar_archive;

/**
 * @brief Signature Verification Context
 */
void * pvSigVerifyContext = NULL;

/**
 * @brief Signature Certificate size
 */
uint32_t ulSignerCertSize;

/**
 * @brief pointer to Signer Certificate
 */
u8 * pucSignerCert = NULL;

/***********************************************************************
 *
 * Functions
 *
 **********************************************************************/

/**
 * @brief Read the specified signer certificate from the filesystem into a local buffer.
 *
 * The allocated memory returned becomes the property of the caller who is responsible for freeing it.
 *
 * This function is called from prvPAL_CheckFileSignature(). It should be implemented if signature
 * verification is not offloaded to non-volatile memory io function.
 *
 * @param[in] pucCertName The file path of the certificate file.
 * @param[out] ulSignerCertSize The size of the certificate file read.
 *
 * @return A pointer to the signer certificate in the file system. NULL if the certificate cannot be read.
 * This returned pointer is the responsibility of the caller; if the memory is allocated the caller must free it.
 */
static uint8_t * prvPAL_ReadAndAssumeCertificate( const uint8_t * const pucCertName,
                                                  uint32_t * const ulSignerCertSize )
{
    uint8_t * pucCertEnd;
    uint8_t * pucDecodedCertificate;
    size_t ulDecodedCertificateSize;

    *ulSignerCertSize = sizeof( signingcredentialSIGNING_CERTIFICATE_PEM );
    /* Skip the "BEGIN CERTIFICATE" */
    uint8_t * pucCertBegin = ( uint8_t * ) strstr( signingcredentialSIGNING_CERTIFICATE_PEM, pcOTA_PAL_CERT_BEGIN );

    if( pucCertBegin == NULL )
    {
        LogError( ( "No Begin found for Certificate" ) );
        return NULL;
    }

    pucCertBegin += sizeof( pcOTA_PAL_CERT_BEGIN );

    /* Find the "END CERTIFICATE" */
    pucCertEnd = ( uint8_t * ) strstr( ( char * ) pucCertBegin, pcOTA_PAL_CERT_END );

    if( pucCertEnd == NULL )
    {
        LogError( ( "No END found for Certificate" ) );
        return NULL;
    }

    mbedtls_base64_decode( NULL, 0, &ulDecodedCertificateSize, pucCertBegin, pucCertEnd - pucCertBegin );
    pucDecodedCertificate = ( uint8_t * ) pvPortMalloc( ulDecodedCertificateSize );

    if( pucDecodedCertificate == NULL )
    {
        LogError( ( "Failed to decode the Certificate" ) );
        return NULL;
    }

    mbedtls_base64_decode( pucDecodedCertificate, ulDecodedCertificateSize, &ulDecodedCertificateSize, pucCertBegin, pucCertEnd - pucCertBegin );

    return pucDecodedCertificate;
}

/**
 * @brief erase the second slot to prepare for writing OTA'ed application
 *
 * @param   N/A
 *
 * @return   0 on success
 *          -1 on error
 */
static int eraseSlotTwo( void )
{
    const struct flash_area * fap;

    if( flash_area_open( FLASH_AREA_IMAGE_SECONDARY( 0 ), &fap ) != 0 )
    {
        LogError( ( "flash_area_open(FLASH_AREA_IMAGE_SECONDARY(0)) failed" ) );
        return -1;
    }

    if( flash_area_erase( fap, 0, fap->fa_size ) != 0 )
    {
        LogError( ( "flash_area_erase(fap, 0) failed" ) );
        return -1;
    }

    flash_area_close( fap );

    return 0;
}

/**
 * @brief callback to handle tar data
 *
 * @param ctxt          untar context
 * @param file_index    index into ctxt->files for the data
 * @param buffer        data to use
 * @param file_offset   offset into the file to store data
 * @param chunk_size    amount of data in buffer to use
 * @param cb_arg        argument passed into initialization
 *
 * return   CY_RSLT_SUCCESS
 *          CY_RSLT_TYPE_ERROR
 */
cy_untar_result_t ota_untar_write_callback( cy_untar_context_ptr ctxt,
                                            uint16_t file_index,
                                            uint8_t * buffer,
                                            uint32_t file_offset,
                                            uint32_t chunk_size,
                                            void * cb_arg )
{
    int type = 0;
    const struct flash_area * fap;
    OtaFileContext_t * const C = ( OtaFileContext_t * ) cb_arg;

    if( ( ctxt == NULL ) || ( buffer == NULL ) || ( C == NULL ) )
    {
        return CY_UNTAR_ERROR;
    }

