divekarshubham/amazon-freertos/vendors/cypress/MTB/ota/ports/CY8CKIT_064S0S2_4343W/ota_pal_for_aws/ota_pal.c
    /*LogDebug( ("%d:%s FILE %d name %s : %s\n", __LINE__, __func__, file_index, ctxt->files[file_index].name, ctxt->files[file_index].type) ); */
    if( strncmp( ctxt->files[ file_index ].type, CY_FILE_TYPE_SPE, strlen( CY_FILE_TYPE_SPE ) ) == 0 )
    {
        type = 1;
    }
    else if( strncmp( ctxt->files[ file_index ].type, CY_FILE_TYPE_NSPE, strlen( CY_FILE_TYPE_NSPE ) ) == 0 )
    {
        type = 0;
    }
    else
    {
        /* unknown file type */
        LogError( ( "BAD FILE TYPE : >%s<", ctxt->files[ file_index ].type ) );
        return CY_UNTAR_ERROR;
    }

    if( flash_area_open( FLASH_AREA_IMAGE_SECONDARY( type ), &fap ) != 0 )
    {
        LogError( ( "flash_area_open(%d) failed", type ) );
        return CY_UNTAR_ERROR;
    }

    if( flash_area_write( fap, file_offset, buffer, chunk_size ) != 0 )
    {
        LogError( ( "flash_area_write() failed" ) );
        flash_area_close( fap );
        return CY_UNTAR_ERROR;
    }

    flash_area_close( fap );

    return CY_UNTAR_SUCCESS;
}

/**
 * @brief Initialization routine for handling tarball OTA file
 *
 * @param ctxt[in,out]  pointer to untar context to be initialized
 * @param C[in]         pointer to system OTA context
 *
 */
cy_rslt_t ota_untar_init_context( cy_untar_context_t * ctxt,
                                  OtaFileContext_t * const C )
{
    if( cy_untar_init( ctxt, ota_untar_write_callback, ( void * ) C ) == CY_RSLT_SUCCESS )
    {
        ota_is_tar_archive = 1;
        return CY_RSLT_SUCCESS;
    }

    return CY_RSLT_TYPE_ERROR;
}

/**
 * @brief De Initialize the signature checking data
 *
 */
static void prvPAL_FileSignatureCheckDeinit( void )
{
    pvSigVerifyContext = NULL;
    ulSignerCertSize = 0;

    if( pucSignerCert != NULL )
    {
        vPortFree( pucSignerCert );
        pucSignerCert = NULL;
    }
}

/**
 * @brief Initialize the signature checking for tarball OTA
 *        We keep track of the interim values for subsequent WriteBlock calls.
 *
 * NOTE: This function is used for a tarball OTA file.
 *
 * This function is called from prvPAL_CreateFile().
 *
 * @param[in] C OTA file context information.
 *
 * @return Below are the valid return values for this function.
 * OTA_ERR_NONE if the signature verification passes.
 * OTA_ERR_SIGNATURE_CHECK_FAILED if the signature verification fails.
 * OTA_ERR_BAD_SIGNER_CERT if the if the signature verification certificate cannot be read.
 */
static OtaErr_t prvPAL_FileSignatureCheckInit( OtaFileContext_t * const C )
{
    if( C == NULL )
    {
        LogError( ( "Bad Args C:%p", C ) );
        return OTA_ERR_SIGNATURE_CHECK_FAILED;
    }

    /* Reset globals for incremental sign check and handle re-entrant calls */
    prvPAL_FileSignatureCheckDeinit();

    /* Verify an ECDSA-SHA256 signature. */
    if( CRYPTO_SignatureVerificationStart( &pvSigVerifyContext, cryptoASYMMETRIC_ALGORITHM_ECDSA,
                                           cryptoHASH_ALGORITHM_SHA256 ) == pdFALSE )
    {
        LogError( ( "CRYPTO_SignatureVerificationStart() failed" ) );
        return OTA_ERR_SIGNATURE_CHECK_FAILED;
    }

    pucSignerCert = prvPAL_ReadAndAssumeCertificate( ( const u8 * const ) C->pCertFilepath, &ulSignerCertSize );

    if( pucSignerCert == NULL )
    {
        LogError( ( "prvPAL_ReadAndAssumeCertificate() failed" ) );
        return OTA_ERR_BAD_SIGNER_CERT;
    }

    return OTA_ERR_NONE;
}

/**
 * @brief incremental update of the signature for tarball OTA
 *
 * NOTE: This function is used for a tarball OTA file.
 *
 * This function is called from otaPal_WriteBlock().
 *
 * @param[in] C         OTA file context information.
 * @param[in] buffer    current buffer to include in signature check
 * @param[in] size      size of buffer
 *
 * @return Below are the valid return values for this function.
 * OTA_ERR_NONE if the signature verification passes.
 * OTA_ERR_SIGNATURE_CHECK_FAILED if the signature verification fails.
 * OTA_ERR_BAD_SIGNER_CERT if the if the signature verification certificate cannot be read.
 */
static OtaErr_t prvPAL_FileSignatureCheckStep( OtaFileContext_t * const C,
                                               uint8_t * buffer,
                                               uint32_t size )
{
    if( ( C == NULL ) || ( C != sys_ctx ) || ( pvSigVerifyContext == NULL ) )
    {
        LogError( ( "Bad Args C:%p", C ) );
        /* Free the signer certificate that we now own after prvReadAndAssumeCertificate(). */
        prvPAL_FileSignatureCheckDeinit();

        if( pvSigVerifyContext == NULL )
        {
            return OTA_ERR_BAD_SIGNER_CERT;
        }

        return OTA_ERR_SIGNATURE_CHECK_FAILED;
    }

    CRYPTO_SignatureVerificationUpdate( pvSigVerifyContext, buffer, size );
    return OTA_ERR_NONE;
}

/**
 * @brief Do the final Signature Check for tarball OTA
 *
 * NOTE: This function is used for a tarball OTA file.
 *
 * This function is called from otaPal_CloseFile().
 *
 * @param[in] C         OTA file context information.
 *
 * @return Below are the valid return values for this function.
 * OTA_ERR_NONE if the signature verification passes.
 * OTA_ERR_SIGNATURE_CHECK_FAILED if the signature verification fails.
 * OTA_ERR_BAD_SIGNER_CERT if the if the signature verification certificate cannot be read.
 */
static OtaErr_t prvPAL_FileSignatureCheckFinal( OtaFileContext_t * const C )
{
    OtaErr_t result = OTA_ERR_NONE;

    if( ( C == NULL ) || ( C != sys_ctx ) || ( pvSigVerifyContext == NULL ) || ( pucSignerCert == NULL ) || ( ulSignerCertSize == 0 ) )
    {
        /* Free the signer certificate that we now own after prvReadAndAssumeCertificate(). */
        prvPAL_FileSignatureCheckDeinit();
        LogError( ( "failed" ) );
        return OTA_ERR_BAD_SIGNER_CERT;
    }

    if( CRYPTO_SignatureVerificationFinal( pvSigVerifyContext, ( char * ) pucSignerCert, ulSignerCertSize,
                                           C->pSignature->data, C->pSignature->size ) == pdFALSE )
    {
        LogError( ( "CRYPTO_SignatureVerificationFinal() failed" ) );
        result = OTA_ERR_SIGNATURE_CHECK_FAILED;
    }

    last_signature_check = result;

