divekarshubham/amazon-freertos/vendors/cypress/MTB/ota/ports/CY8CKIT_064S0S2_4343W/ota_pal_for_aws/ota_pal.c
    /* Free the signer certificate that we now own after prvReadAndAssumeCertificate(). */
    prvPAL_FileSignatureCheckDeinit();
    return result;
}

/**
 * @brief Abort an OTA transfer.
 *
 * Aborts access to an existing open file represented by the OTA file context C. This is only valid
 * for jobs that started successfully.
 *
 * @note The input OtaFileContext_t C is checked for NULL by the OTA agent before this
 * function is called.
 * This function may be called before the file is opened, so the file pointer C->pFile may be NULL
 * when this function is called.
 *
 * @param[in] C OTA file context information.
 *
 * @return The OTA PAL layer error code combined with the MCU specific error code. See OTA Agent
 * error codes information in aws_ota_agent.h.
 *
 * The file pointer will be set to NULL after this function returns.
 * OTA_ERR_NONE is returned when aborting access to the open file was successful.
 * OTA_ERR_ABORT_FAILED is returned when aborting access to the open file context was unsuccessful.
 */
OtaErr_t otaPal_Abort( OtaFileContext_t * const C )
{
    OtaErr_t result = OTA_ERR_NONE;
    const struct flash_area * fap;

    if( ( C != NULL ) && ( C->pFile == ( uint32_t ) NULL ) )
    {
        return OTA_ERR_NONE;
    }

    if( ( C == NULL ) || ( C != sys_ctx ) )
    {
        LogError( ( "BAD ARGS" ) );
        return OTA_ERR_ABORT_FAILED;
    }

    fap = ( const struct flash_area * ) C->pFile;

    if( fap != NULL )
    {
        flash_area_close( fap ); /* May have been closed already */
    }

    /* reset our globals */
    C->pFile = 0;
    sys_ctx = 0;

    /* Free the signer certificate that we now own after prvReadAndAssumeCertificate(). */
    prvPAL_FileSignatureCheckDeinit();
    return result;
}

/**
 * @brief Create a new receive file for the data chunks as they come in.
 *
 * @note Opens the file indicated in the OTA file context in the MCU file system.
 *
 * @note The previous image may be present in the designated image download partition or file, so the partition or file
 * must be completely erased or overwritten in this routine.
 *
 * @note The input OtaFileContext_t C is checked for NULL by the OTA agent before this
 * function is called.
 * The device file path is a required field in the OTA job document, so C->pFilePath is
 * checked for NULL by the OTA agent before this function is called.
 *
 * @param[in] C OTA file context information.
 *
 * @return The OTA PAL layer error code combined with the MCU specific error code. See OTA Agent
 * error codes information in aws_ota_agent.h.
 *
 * OTA_ERR_NONE is returned when file creation is successful.
 * OTA_ERR_RX_FILE_TOO_LARGE is returned if the file to be created exceeds the device's non-volatile memory size contraints.
 * OTA_ERR_BOOT_INFO_CREATE_FAILED is returned if the bootloader information file creation fails.
 * OTA_ERR_RX_FILE_CREATE_FAILED is returned for other errors creating the file in the device's non-volatile memory.
 */
OtaErr_t otaPal_CreateFileForRx( OtaFileContext_t * const C )
{
    OtaErr_t result = OTA_ERR_NONE;
    const struct flash_area * fap;

    if( C == NULL )
    {
        LogError( ( "BAD ARGS" ) );
        return OTA_ERR_RX_FILE_CREATE_FAILED;
    }

    /* prepare the slot for writing */
    eraseSlotTwo();

    /* Must set something into pFile and we use for MQTT downloads */
    if( flash_area_open( FLASH_AREA_IMAGE_SECONDARY( 0 ), &fap ) != 0 )
    {
        LogError( ( "flash_area_open() failed" ) );
        return OTA_ERR_RX_FILE_CREATE_FAILED;
    }

    /* NOTE: pFile MUST be non-NULL of the OTA Agent will error out */
    C->pFile = ( int32_t ) fap;
    sys_ctx = C;

    /* initialize these for checking later */
    last_signature_check = OTA_ERR_UNINITIALIZED;
    pvSigVerifyContext = NULL;
    pvSigVerifyContext = NULL;
    pucSignerCert = NULL;
    ulSignerCertSize = 0;
    return result;
}

/**
 * @brief Authenticate and close the underlying receive file in the specified OTA context.
 *
 * @note The input OtaFileContext_t C is checked for NULL by the OTA agent before this
 * function is called. This function is called only at the end of block ingestion.
 * otaPal_CreateFileForRx() must succeed before this function is reached, so
 * C->pFile(or C->pFile) is never NULL.
 * The certificate path on the device is a required job document field in the OTA Agent,
 * so C->pCertFilepath is never NULL.
 * The file signature key is required job document field in the OTA Agent, so C->pSignature will
 * never be NULL.
 *
 * If the signature verification fails, file close should still be attempted.
 *
 * @param[in] C OTA file context information.
 *
 * @return The OTA PAL layer error code combined with the MCU specific error code. See OTA Agent
 * error codes information in aws_ota_agent.h.
 *
 * OTA_ERR_NONE is returned on success.
 * OTA_ERR_SIGNATURE_CHECK_FAILED is returned when cryptographic signature verification fails.
 * OTA_ERR_BAD_SIGNER_CERT is returned for errors in the certificate itself.
 * OTA_ERR_FILE_CLOSE is returned when closing the file fails.
 */
OtaErr_t otaPal_CloseFile( OtaFileContext_t * const C )
{
    OtaErr_t result = OTA_ERR_NONE;

    if( ( C == NULL ) || ( C != sys_ctx ) || ( C->pFile == 0 ) )
    {
        LogError( ( "BAD ARGS" ) );
        result = OTA_ERR_FILE_CLOSE;
        goto _exit_CloseFile;
    }

    /* we got the data, try to verify it */
    if( C->pSignature == NULL )
    {
        LogError( ( "No pSignature from AWS" ) );
        result = OTA_ERR_SIGNATURE_CHECK_FAILED;
        goto _exit_CloseFile;
    }

    /* For TAR files, we must use HTTP transport so that the file blocks come down
     * in sequential order - we need start of TAR (components.json) first, and we
     * do not store all of the blocks. Signature must be checked in sequential order.
     */
    if( ota_is_tar_archive == 1 )
    {
        /* Do the final check for signature */
        if( prvPAL_FileSignatureCheckFinal( C ) == OTA_ERR_NONE )
        {
            /* Mark this new OTA image as pending, it will be the permanent
             * bootable image going forward.
             */
            LogInfo( ( "TAR prvPAL_FileSignatureCheckFinal() GOOD" ) );
            boot_set_pending( 0 );
        }
        else
        {
            LogError( ( "TAR prvPAL_FileSignatureCheckFinal() failed" ) );
            eraseSlotTwo();
            result = OTA_ERR_SIGNATURE_CHECK_FAILED;
        }
    }
    else
    {
        /* non-tar OTA, we downloaded a single file, might have been MQTT.
         * If MQTT, the file blocks may come in non-sequential order.
         * We need to run signature check across entire downloaded file at once.
         */
        const struct flash_area * fap;

        /*LogDebug( ( "%s() BINARY file, check whole file for signature\n", __func__) ); */
        fap = ( const struct flash_area * ) C->pFile;

