divekarshubham/amazon-freertos/vendors/cypress/MTB/ota/ports/CY8CKIT_064S0S2_4343W/ota_pal_for_aws/ota_pal.c
        if( fap == 0 )
        {
            LogError( ( "ERROR: fap == NULL" ) );
            result = OTA_ERR_SIGNATURE_CHECK_FAILED;
            goto _exit_CloseFile;
        }

        result = prvPAL_FileSignatureCheckInit( C );

        if( result == OTA_ERR_NONE )
        {
            uint32_t addr;
            addr = 0;

            while( addr < C->fileSize )
            {
                uint32_t toread = C->fileSize - addr;

                /* Re-use coalesce buffer as we have completed download (it is not used for non-TAR OTA) */
                if( toread > sizeof( ota_untar_context.coalesce_buffer ) )
                {
                    toread = sizeof( ota_untar_context.coalesce_buffer );
                }

                if( flash_area_read( fap, addr, ota_untar_context.coalesce_buffer, toread ) < 0 )
                {
                    LogError( ( "flash_area_read() failed for signature check" ) );
                    result = OTA_ERR_SIGNATURE_CHECK_FAILED;
                    goto _exit_CloseFile;
                }

                CRYPTO_SignatureVerificationUpdate( pvSigVerifyContext, ota_untar_context.coalesce_buffer, toread );

                addr += toread;
            }

            if( prvPAL_FileSignatureCheckFinal( C ) == OTA_ERR_NONE )
            {
                /* Mark this new OTA image as pending, it will be the permanent
                 * bootable image going forward.
                 */
                LogInfo( ( "BIN prvPAL_FileSignatureCheckFinal() GOOD" ) );
                boot_set_pending( 0 );
            }
            else
            {
                LogError( ( "BIN prvPAL_FileSignatureCheckFinal() failed" ) );
                eraseSlotTwo();
                result = OTA_ERR_SIGNATURE_CHECK_FAILED;
            }
        }
    }

_exit_CloseFile:

    if( ( C != NULL ) && ( C->pFile != 0 ) )
    {
        const struct flash_area * fap;
        fap = ( const struct flash_area * ) C->pFile;
        flash_area_close( fap );
    }

    /* Free the signer certificate that we now own after prvReadAndAssumeCertificate(). */
    prvPAL_FileSignatureCheckDeinit();

    if( result != OTA_ERR_NONE )
    {
        current_OTA_ImageState = OtaImageStateUnknown;
    }

    return result;
}

/**
 * @brief Write a block of data to the specified file at the given offset.
 *
 * @note The input OtaFileContext_t C is checked for NULL by the OTA agent before this
 * function is called.
 * The file pointer/handle C->pFile, is checked for NULL by the OTA agent before this
 * function is called.
 * pcData is checked for NULL by the OTA agent before this function is called.
 * ulBlockSize is validated for range by the OTA agent before this function is called.
 * ulBlockIndex is validated by the OTA agent before this function is called.
 *
 * @param[in] C OTA file context information.
 * @param[in] ulOffset Byte offset to write to from the beginning of the file.
 * @param[in] pcData Pointer to the byte array of data to write.
 * @param[in] ulBlockSize The number of bytes to write.
 *
 * @return The number of bytes written on a success, or a negative error code from the platform abstraction layer.
 */
int16_t otaPal_WriteBlock( OtaFileContext_t * const C,
                           uint32_t ulOffset,
                           uint8_t * const pcData,
                           uint32_t ulBlockSize )
{
    if( ( C == NULL ) || ( C != sys_ctx ) )
    {
        LogError( ( "BAD ARGS" ) );
        return -1;
    }

    /* we need to check some things when we receive the first block */
    if( ulOffset == 0UL )
    {
        /*
         * initialize file signature checking
         */
        if( prvPAL_FileSignatureCheckInit( C ) != OTA_ERR_NONE )
        {
            LogError( ( "prvPAL_FileSignatureCheckInit() FAILED" ) );
            return -1;
        }

        /*
         * Check for incoming tarball (as opposed to a single file OTA)
         */
        if( cy_is_tar_header( pcData, ulBlockSize ) == CY_UNTAR_SUCCESS )
        {
            if( ota_untar_init_context( &ota_untar_context, C ) != CY_RSLT_SUCCESS )
            {
                LogError( ( "ota_untar_init_context() FAILED" ) );
                return -1;
            }
        }
    }

    /* treat a tar file differently from a "normal" OTA */
    if( ota_is_tar_archive != 0 )
    {
        uint32_t consumed = 0;

        /* check the signature incrementally over every block received */
        if( prvPAL_FileSignatureCheckStep( C, pcData, ulBlockSize ) != OTA_ERR_NONE )
        {
            LogError( ( "FileSignatureCheckStep() offset:%ld FAILED", ulOffset ) );
            return -1;
        }

        while( consumed < ulBlockSize )
        {
            cy_untar_result_t result;
            result = cy_untar_parse( &ota_untar_context, ( ulOffset + consumed ), &pcData[ consumed ], ( ulBlockSize - consumed ), &consumed );

            if( ( result == CY_UNTAR_ERROR ) || ( result == CY_UNTAR_INVALID ) )
            {
                LogError( ( "cy_untar_parse() FAIL consumed:%ld sz:%ld result:%ld", consumed, ulBlockSize, result ) );
                return -1;
            }

            /* Yield for a bit */
            vTaskDelay( 1 );
        }

        /* with the tarball we get a version - check if it is > current so we can bail early */
        #ifdef CY_TEST_APP_VERSION_IN_TAR
            if( ota_untar_context.version[ 0 ] != 0 )
            {
                /* example version string "<major>.<minor>.<build>" */
                uint16_t major = 0;
                uint16_t minor = 0;
                uint16_t build = 0;
                char * dot;
                major = atoi( ota_untar_context.version );
                dot = strstr( ota_untar_context.version, "." );

                if( dot != NULL )
                {
                    dot++;
                    minor = atoi( dot );
                    dot = strstr( dot, "." );

                    if( dot != NULL )
                    {
                        dot++;
                        build = atoi( dot );

                        if( ( major < APP_VERSION_MAJOR ) ||
                            ( ( major == APP_VERSION_MAJOR ) &&
                              ( minor < APP_VERSION_MINOR ) ) ||
                            ( ( major == APP_VERSION_MAJOR ) &&
                              ( minor == APP_VERSION_MINOR ) &&
                              ( build <= APP_VERSION_BUILD ) ) )
                        {
                            LogDebug( ( "OTA image version %d.%d.%d <= current %d.%d.%d-- bail!",
                                        major, minor, build,
                                        APP_VERSION_MAJOR, APP_VERSION_MINOR, APP_VERSION_BUILD ) );

                            return -1;
                        }
                    }
                }
            }
        #endif /* CY_TEST_APP_VERSION_IN_TAR */
    }
    else
    {
        /* non-tarball OTA here */
        const struct flash_area * fap;
        fap = ( const struct flash_area * ) C->pFile;

        if( fap == NULL )
        {
            LogError( ( "flash_area_pointer is NULL" ) );
            return -1;
        }

        if( flash_area_write( fap, ulOffset, pcData, ulBlockSize ) != 0 )
        {
            LogError( ( "flash_area_write() FAILED" ) );
            return -1;
        }
    }

    return ulBlockSize;
}

/**
 * @brief Activate the newest MCU image received via OTA.
 *
 * This function shall do whatever is necessary to activate the newest MCU
 * firmware received via OTA. It is typically just a reset of the device.
 *
 * @note This function SHOULD not return. If it does, the platform doesn't support
 * an automatic reset or an error occurred.
 *
 * @return The OTA PAL layer error code combined with the MCU specific error code. See OTA Agent
 * error codes information in aws_ota_agent.h.
 */
OtaErr_t otaPal_ActivateNewImage( OtaFileContext_t * const C )
{
    LogInfo( ( "entered %s()", __func__ ) );
    otaPal_ResetDevice( C );
    return OTA_ERR_NONE;
}

/**
 * @brief Reset the device.
 *
 * This function shall reset the MCU and cause a reboot of the system.
 *
 * @note This function SHOULD not return. If it does, the platform doesn't support
 * an automatic reset or an error occurred.
 *
 * @return The OTA PAL layer error code combined with the MCU specific error code. See OTA Agent
 * error codes information in aws_ota_agent.h.
 */
OtaErr_t otaPal_ResetDevice( OtaFileContext_t * const C )
{
    ( void ) C;

