divekarshubham/amazon-freertos/vendors/cypress/MTB/ota/ports/CY8CKIT_064S0S2_4343W/ota_pal_for_aws/ota_pal.c
    /* we want to wait a bit when in DEBUG builds so the logging mechanism can finish before resetting */
    vTaskDelay( pdMS_TO_TICKS( 1000UL ) );
    LogInfo( ( "Resetting now" ) );
    vTaskDelay( pdMS_TO_TICKS( 1000UL ) );
    NVIC_SystemReset();
    return OTA_ERR_NONE;
}

/**
 * @brief Attempt to set the state of the OTA update image.
 *
 * Do whatever is required by the platform to Accept/Reject the OTA update image (or bundle).
 * Refer to the PAL implementation to determine what happens on your platform.
 *
 * @param[in] eState The desired state of the OTA update image.
 *
 * @return The OtaErr_t error code combined with the MCU specific error code. See aws_ota_agent.h for
 *         OTA major error codes and your specific PAL implementation for the sub error code.
 *
 * Major error codes returned are:
 *
 *   OTA_ERR_NONE on success.
 *   OTA_ERR_BAD_IMAGE_STATE: if you specify an invalid OTA_ImageState_t. No sub error code.
 *   OTA_ERR_ABORT_FAILED: failed to roll back the update image as requested by OtaImageStateAborted.
 *   OTA_ERR_REJECT_FAILED: failed to roll back the update image as requested by OtaImageStateRejected.
 *   OTA_ERR_COMMIT_FAILED: failed to make the update image permanent as requested by OtaImageStateAccepted.
 *
 *
 *   IMPORTANT NOTES:
 *
 *   Our implementation checks the signature on the call to otaPal_CloseFile().
 *   We assume that if the updated app is running in slot 0 that it is acceptable.
 *
 *   if otaPal_SetPlatformImageState() is called and the sys_ctx is NULL, we are not in the process of downloading a new image.
 *      if the eState is Rejected or Aborted, it pertains to the in-process download (or invalid job) for Secondary Slot.
 *      We could erase the secondary slot, but we do that each new download start, and will not consider new download OK if not complete.
 *
 */
OtaErr_t otaPal_SetPlatformImageState( OtaFileContext_t * const C,
                                       OtaImageState_t eState )
{
    OtaErr_t result = OTA_ERR_NONE;

    ( void ) C;

    PRINT_eSTATE( "-------------------------> otaPal_SetPlatformImageState() curr eState:", current_OTA_ImageState );
    PRINT_eSTATE( "-------------------------> otaPal_SetPlatformImageState() new  eSTATE:", eState );
    PRINT_SYSTEM_CONTEXT_PTR();
    PRINT_BOOT_SWAP_TYPE( NULL, boot_swap_type() );

    if( ( eState == OtaImageStateUnknown ) || ( eState > OtaLastImageState ) )
    {
        return OTA_ERR_BAD_IMAGE_STATE;
    }

    if( sys_ctx == NULL )
    {
        /* We are not currently loading an OTA image. This state change pertains to Slot 0 image */
        switch( eState )
        {
            case OtaImageStateAccepted:

                /* Mark Slot 0 image as valid */
                /* We need to know if the last check was good... */
                if( last_signature_check == OTA_ERR_NONE )
                {
                    boot_set_confirmed();
                }
                else
                {
                    result = OTA_ERR_COMMIT_FAILED;
                }

                break;

            case OtaImageStateRejected:
                /* we haven't closed the file, and the OTA Agent has rejected the download */
                result = OTA_ERR_NONE;
                break;

            case OtaImageStateAborted:

                /* We are not actively downloading, this pertains to an invalid download job
                 * or an aborted job. We erase secondary slot when we start a new download,
                 * and do not consider secondary slot ready unless download completes and
                 * signature checked. nothing to do here, but set our state to Accepted so
                 * we store it for GetImageState().
                 */
                eState = OtaImageStateAccepted;
                break;

            case OtaImageStateTesting:
                break;

            default:
                result = OTA_ERR_BAD_IMAGE_STATE;
                break;
        }
    }
    else
    {
        /* We are in the middle of a new download
         * Abort or Reject refers to the new download, not the primary slot.
         * Nothing to do here.
         */
        if( eState == OtaImageStateAccepted )
        {
            if( sys_ctx->pFile != ( uint32_t ) NULL )
            {
                result = OTA_ERR_COMMIT_FAILED;
            }
        }
    }

    /* keep track of the state OTA Agent sent. */
    current_OTA_ImageState = eState;

    PRINT_BOOT_SWAP_TYPE( NULL, boot_type );
    PRINT_eSTATE( "-------------------------> otaPal_SetPlatformImageState() current  eSTATE:", eState );
    PRINT_SYSTEM_CONTEXT_PTR();
    PRINT_BOOT_SWAP_TYPE( NULL, boot_type );

    return result;
}


/**
 * @brief Get the state of the OTA update image.
 *
 * We read this at OTA_Init time and when the latest OTA job reports itself in self
 * test. If the update image is in the "pending commit" state, we start a self test
 * timer to assure that we can successfully connect to the OTA services and accept
 * the OTA update image within a reasonable amount of time (user configurable). If
 * we don't satisfy that requirement, we assume there is something wrong with the
 * firmware and automatically reset the device, causing it to roll back to the
 * previously known working code.
 *
 * If the update image state is not in "pending commit," the self test timer is
 * not started.
 *
 * @return An OtaPalImageState_t. One of the following:
 *   OtaPalImageStatePendingCommit (the new firmware image is in the self test phase)
 *   OtaPalImageStateValid         (the new firmware image is already committed)
 *   OtaPalImageStateInvalid       (the new firmware image is invalid or non-existent)
 *
 *   NOTE: OtaPalImageStateUnknown should NEVER be returned and indicates an implementation error.
 *
 * We are testing the New application.
 * BOOT_SWAP_TYPE_NONE     1
 * BOOT_SWAP_TYPE_TEST     2    Swap to the secondary slot. Absent a confirm command (STDE - Valid?), revert back on next boot.
 * BOOT_SWAP_TYPE_PERM     3    Swap to the secondary slot, and permanently switch to booting its contents.
 * BOOT_SWAP_TYPE_REVERT   4    Swap back to alternate slot.  A confirm (STDE - Valid?) changes this state to NONE.
 * BOOT_SWAP_TYPE_FAIL     5    Swap failed because image to be run is not valid
 * BOOT_SWAP_TYPE_PANIC    0xff Swapping encountered an unrecoverable error
 */

OtaPalImageState_t otaPal_GetPlatformImageState( OtaFileContext_t * const C )
{
    OtaPalImageState_t result = OtaPalImageStateUnknown;

    ( void ) C;

    PRINT_eSTATE( "<------------------------- otaPal_GetPlatformImageState() current  eSTATE:", current_OTA_ImageState );
    PRINT_SYSTEM_CONTEXT_PTR();
    PRINT_BOOT_SWAP_TYPE( NULL, boot_swap_type() );

    /**
     * After swap/copy of secondary slot to primary slot, boot_swap_type() returns NONE.
     * It does not reflect the fact we may be in self-test mode.
     * Use the saved value from SetImageState() to report our status.
     */
    if( current_OTA_ImageState == OtaImageStateTesting )
    {
        /* in self-test, report Pending. */
        result = OtaPalImageStatePendingCommit;
    }
    else if( ( current_OTA_ImageState == OtaImageStateRejected ) ||
             ( current_OTA_ImageState == OtaImageStateAborted ) )
    {
        result = OtaPalImageStateInvalid;
    }
    else if( current_OTA_ImageState == OtaImageStateAccepted )
    {
        result = OtaPalImageStateValid;
    }
    else
    {
        /*result = OtaPalImageStateValid; */
        result = OtaImageStateUnknown;
    }

    PRINT_PAL_STATE( "<------------------------- otaPal_GetPlatformImageState() DONE: ", result );
    return result;
}

/*-----------------------------------------------------------*/
